{
  "movies": [
    {
      "name": "The Shawshank Redemption",
      "description": "Over the course of several years, two convicts form a friendship, seeking consolation and, eventually, redemption through basic compassion.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "The Godfather",
      "description": "The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Dark Knight",
      "description": null,
      "genre": [
        "Action",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Godfather Part II",
      "description": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "12 Angry Men",
      "description": null,
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Schindler's List",
      "description": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "The Lord of the Rings: The Return of the King",
      "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
      "genre": [
        "Action",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "The Lord of the Rings: The Fellowship of the Ring",
      "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
      "genre": [
        "Action",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "The Good, the Bad and the Ugly",
      "description": null,
      "genre": [
        "Animation",
        "Short",
        "Action"
      ]
    },
    {
      "name": "Forrest Gump",
      "description": null,
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Fight Club",
      "description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "The Lord of the Rings: The Two Towers",
      "description": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
      "genre": [
        "Action",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "Inception",
      "description": null,
      "genre": [
        "Action",
        "Adventure",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Star Wars: Episode V - The Empire Strikes Back: Deleted Scenes",
      "description": "Deleted scenes from Star Wars: Episode V - The Empire Strikes Back (1980).",
      "genre": [
        "Short",
        "Action",
        "Drama"
      ]
    },
    {
      "name": "The Matrix",
      "description": null,
      "genre": [
        "Action",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "GoodFellas",
      "description": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
      "genre": [
        "Biography",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "One Flew Over the Cuckoo's Nest",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Se7en",
      "description": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Shichinin no samurai",
      "description": "Farmers from a village exploited by bandits hire a veteran samurai for protection, who gathers six other samurai to join him.",
      "genre": [
        "Action",
        "Drama"
      ]
    },
    {
      "name": "Saving Private Ryan",
      "description": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Cidade de Deus",
      "description": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Interstellar",
      "description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
      "genre": [
        "Adventure",
        "Drama",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Life Is Beautiful",
      "description": "When an open-minded Jewish waiter and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp.",
      "genre": [
        "Comedy",
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "The Green Mile",
      "description": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.",
      "genre": [
        "Crime",
        "Drama",
        "Fantasy"
      ]
    },
    {
      "name": "Star Wars: The Bad Batch",
      "description": "The 'Bad Batch' of elite and experimental clones make their way through an ever-changing galaxy in the immediate aftermath of the Clone Wars.",
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "Terminator 2: Judgment Day",
      "description": null,
      "genre": [
        "Action",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Spirited Away",
      "description": null,
      "genre": [
        "Animation",
        "Adventure",
        "Family"
      ]
    },
    {
      "name": "The Pianist",
      "description": "A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.",
      "genre": [
        "Biography",
        "Drama",
        "Music"
      ]
    },
    {
      "name": "Psycho",
      "description": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother.",
      "genre": [
        "Horror",
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "Gisaengchung",
      "description": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
      "genre": [
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Leon",
      "description": "12-year-old Mathilda is reluctantly taken in by Leon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protégée and learns the assassin's trade.",
      "genre": [
        "Action",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Lion King",
      "description": "After the murder of his father, a young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery.",
      "genre": [
        "Animation",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "Gladiator",
      "description": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
      "genre": [
        "Action",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "American History X",
      "description": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Prestige",
      "description": null,
      "genre": [
        "Drama",
        "Mystery",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Whiplash",
      "description": null,
      "genre": [
        "Drama",
        "Music"
      ]
    },
    {
      "name": "Grave of the fireflies(English sub)",
      "description": "A young boy and his little sister struggle to survive in Japan during World War II.",
      "genre": [
        "Animation", 
        "Drama",
        "War"
      ]
    },
    {
      "name": "Seppuku",
      "description": null,
      "genre": [
        "Action",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Intouchables",
      "description": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.",
      "genre": [
        "Biography",
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Modern Times",
      "description": null,
      "genre": [
        "Comedy",
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Once Upon A Time in the West",
      "description": "The short tells the story of John Wayne, a 64-year-old man with an unknown past who constantly struggles to abandon his psychopathic habits, but, unfortunately, fails. But can he live with that? Can he live with the weight of deat...",
      "genre": [
        "Short",
        "Western"
      ]
    },
    {
      "name": "Nuovo Cinema Paradiso",
      "description": "A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist.",
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "City Lights",
      "description": "With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically.",
      "genre": [
        "Comedy",
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Apocalypse Now",
      "description": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
      "genre": [
        "Drama",
        "Mystery",
        "War"
      ]
    },
    {
      "name": "Memento",
      "description": null,
      "genre": [
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "Django Unchained",
      "description": "With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation owner in Mississippi.",
      "genre": [
        "Drama",
        "Western"
      ]
    },
    {
      "name": "Raiders of the Lost Ark",
      "description": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before the Nazis can obtain its awesome powers.",
      "genre": [
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "The Lives of Others",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Sunset Blvd.",
      "description": null,
      "genre": [
        "Drama",
        "Film_Noir"
      ]
    },
    {
      "name": "The Shining",
      "description": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
      "genre": [
        "Drama",
        "Horror"
      ]
    },
    {
      "name": "The Great Dictator",
      "description": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
      "genre": [
        "Comedy",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Avengers: Infinity War",
      "description": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
      "genre": [
        "Action",
        "Adventure",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Witness for the Prosecution",
      "description": "A veteran British barrister must defend his client in a murder trial that has surprise after surprise.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Spider-Man: Into the Spider-Verse",
      "description": "Teen Miles Morales becomes the Spider-Man of his universe, and must join with five spider-powered individuals from other dimensions to stop a threat for all realities.",
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "American Beauty",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
      "description": null,
      "genre": [
        "Comedy",
        "War"
      ]
    },
    {
      "name": "The Dark Knight Rises",
      "description": null,
      "genre": [
        "Action",
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Oldeuboi",
      "description": null,
      "genre": [
        "Action",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Inglourious Basterds",
      "description": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
      "genre": [
        "Adventure",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Coco",
      "description": "Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Toy Story",
      "description": null,
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Joker",
      "description": null,
      "genre": [
        "Crime",
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Braveheart",
      "description": "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.",
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "Das Boot",
      "description": null,
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Avengers: Endgame",
      "description": null,
      "genre": [
        "Action",
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "Mononoke-hime",
      "description": null,
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "Once Upon a Time in America",
      "description": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan 35 years later, where he must once again confront the ghosts and regrets of his old life.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Good Will Hunting",
      "description": "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Kimi no na wa.",
      "description": null,
      "genre": [
        "Animation",
        "Drama",
        "Fantasy"
      ]
    },
    {
      "name": "Singin' in the Rain",
      "description": "A silent film star falls for a chorus girl just as he and his delusionally jealous screen partner are trying to make the difficult transition to talking pictures in 1920s Hollywood.",
      "genre": [
        "Comedy",
        "Musical",
        "Romance"
      ]
    },
    {
      "name": "3 Idiots",
      "description": null,
      "genre": [
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Requiem for a Dream",
      "description": "The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Tengoku to jigoku",
      "description": "An executive of a Yokohama shoe company becomes a victim of extortion when his chauffeur's son is kidnapped by mistake and held for ransom.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Toy Story 3",
      "description": "The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Capernaum",
      "description": "While serving a five-year sentence for a violent crime, a 12-year-old boy sues his parents for neglect.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Star Wars: Episode VI - Return of the Jedi",
      "description": "After rescuing Han Solo from Jabba the Hutt, the Rebels attempt to destroy the second Death Star, while Luke struggles to help Darth Vader back from the dark side.",
      "genre": [
        "Action",
        "Adventure",
        "Fantasy"
      ]
    },
    {
      "name": "2001: A Space Odyssey",
      "description": null,
      "genre": [
        "Adventure",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Eternal Sunshine of the Spotless Mind",
      "description": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories for ever.",
      "genre": [
        "Drama",
        "Romance",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Reservoir Dogs",
      "description": null,
      "genre": [
        "Crime",
        "Thriller"
      ]
    },
    {
      "name": "Citizen Kane",
      "description": null,
      "genre": [
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "M*A*S*H",
      "description": "The staff of an Army hospital in the Korean War find that laughter is the best way to deal with their situation.",
      "genre": [
        "Comedy",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Lawrence of Arabia",
      "description": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
      "genre": [
        "Adventure",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "Ikiru",
      "description": "A bureaucrat tries to find meaning in his life after he discovers he has terminal cancer.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Vertigo",
      "description": "A former San Francisco police detective juggles wrestling with his personal demons and becoming obsessed with the hauntingly beautiful woman he has been hired to trail, who may be deeply disturbed.",
      "genre": [
        "Mystery",
        "Romance",
        "Thriller"
      ]
    },
    {
      "name": "The Apartment",
      "description": "A Manhattan insurance clerk tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.",
      "genre": [
        "Comedy",
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Amélie",
      "description": "Amélie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.",
      "genre": [
        "Comedy",
        "Romance"
      ]
    },
    {
      "name": "A Clockwork Orange",
      "description": "In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned.",
      "genre": [
        "Crime",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Double Indemnity",
      "description": "A Los Angeles insurance representative lets an alluring housewife seduce him into a scheme of insurance fraud and murder that arouses the suspicion of his colleague, an insurance investigator.",
      "genre": [
        "Crime",
        "Drama",
        "Film_Noir"
      ]
    },
    {
      "name": "Full Metal Jacket",
      "description": null,
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Hamilton",
      "description": "The real life of one of America's foremost founding fathers and first Secretary of the Treasury, Alexander Hamilton. Captured live on Broadway from the Richard Rodgers Theater with the original Broadway cast.",
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "Incendies",
      "description": null,
      "genre": [
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "To Kill a Mockingbird",
      "description": null,
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Heat",
      "description": "A group of high-end professional thieves start to feel the heat from the LAPD when they unknowingly leave a clue at their latest heist.",
      "genre": [
        "Action",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Up",
      "description": "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Top Gun: Maverick",
      "description": null,
      "genre": [
        "Action",
        "Drama"
      ]
    },
    {
      "name": "Jodaeiye Nader az Simin",
      "description": "A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Metropolis",
      "description": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working-class prophet who predicts the coming of a savior to mediate their differences.",
      "genre": [
        "Drama",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Taxi Driver",
      "description": null,
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Snatch",
      "description": null,
      "genre": [
        "Comedy",
        "Crime"
      ]
    },
    {
      "name": "Indiana Jones and the Last Crusade",
      "description": null,
      "genre": [
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "Taare Zameen Par",
      "description": "An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.",
      "genre": [
        "Drama",
        "Family"
      ]
    },
    {
      "name": "1917",
      "description": "April 6th, 1917. As an infantry battalion assembles to wage war deep in enemy territory, two soldiers are assigned to race against time and deliver a message that will stop 1,600 men from walking straight into a deadly trap.",
      "genre": [
        "Action",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Der Untergang",
      "description": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.",
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "Dangal",
      "description": "Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression.",
      "genre": [
        "Action",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "For A Few Dollars More",
      "description": null,
      "genre": [
        "Western"
      ]
    },
    {
      "name": "The Father",
      "description": "A man refuses all assistance from his daughter as he ages. As he tries to make sense of his changing circumstances, he begins to doubt his loved ones, his own mind and even the fabric of his reality.",
      "genre": [
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "All About Eve",
      "description": "A seemingly timid but secretly ruthless ingénue insinuates herself into the lives of an aging Broadway star and her circle of theater friends.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "The Wolf of Wall Street",
      "description": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.",
      "genre": [
        "Biography",
        "Comedy",
        "Crime"
      ]
    },
    {
      "name": "Green Book",
      "description": null,
      "genre": [
        "Biography",
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Judgment at Nuremberg",
      "description": "In 1948, an American court in occupied Germany tries four Nazis judged for war crimes.",
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Ran",
      "description": null,
      "genre": [
        "Action",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Casino",
      "description": null,
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Truman Show",
      "description": null,
      "genre": [
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "El laberinto del fauno",
      "description": null,
      "genre": [
        "Drama",
        "Fantasy",
        "War"
      ]
    },
    {
      "name": "There Will Be Blood",
      "description": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Unforgiven",
      "description": null,
      "genre": [
        "Drama",
        "Western"
      ]
    },
    {
      "name": "The Sixth Sense",
      "description": "A frightened, withdrawn Philadelphia boy who communicates with spirits seeks the help of a disheartened child psychologist.",
      "genre": [
        "Drama",
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "Shutter Island",
      "description": null,
      "genre": [
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "A Beautiful Mind",
      "description": "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish.",
      "genre": [
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "Jurassic Park",
      "description": "A pragmatic paleontologist touring an almost complete theme park on an island in Central America is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.",
      "genre": [
        "Action",
        "Adventure",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "The Treasure of the Sierra Madre",
      "description": null,
      "genre": [
        "Adventure",
        "Drama",
        "Western"
      ]
    },
    {
      "name": "No Country for Old Men",
      "description": null,
      "genre": [
        "Crime",
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Kill Bill: Vol. 1",
      "description": "After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.",
      "genre": [
        "Action",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Rashomon",
      "description": "The rape of a bride and the murder of her samurai husband are recalled from the perspectives of a bandit, the bride, the samurai's ghost and a woodcutter.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Spider-Man: No Way Home",
      "description": "With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.",
      "genre": [
        "Action",
        "Adventure",
        "Fantasy"
      ]
    },
    {
      "name": "Finding Nemo",
      "description": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "The Elephant Man",
      "description": null,
      "genre": [
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "Chinatown",
      "description": "A private detective hired to expose an adulterer in 1930s Los Angeles finds himself caught up in a web of deceit, corruption, and murder.",
      "genre": [
        "Drama",
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "Raging Bull",
      "description": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
      "genre": [
        "Biography",
        "Drama",
        "Sport"
      ]
    },
    {
      "name": "V for Vendetta",
      "description": null,
      "genre": [
        "Action",
        "Drama",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Gone with the Wind",
      "description": "American motion picture classic in which a manipulative woman and a roguish man conduct a turbulent romance during the Civil War and Reconstruction periods.",
      "genre": [
        "Drama",
        "Romance",
        "War"
      ]
    },
    {
      "name": "Lock, Stock and Two Smoking Barrels",
      "description": "Eddy persuades his three pals to pool money for a vital poker game against a powerful local mobster, Hatchet Harry. Eddy loses, after which Harry gives him a week to pay back 500,000 pounds.",
      "genre": [
        "Action",
        "Comedy",
        "Crime"
      ]
    },
    {
      "name": "Inside Out",
      "description": null,
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Dial M for Murder",
      "description": null,
      "genre": [
        "Crime",
        "Thriller"
      ]
    },
    {
      "name": "El secreto de sus ojos",
      "description": "A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.",
      "genre": [
        "Drama",
        "Mystery",
        "Romance"
      ]
    },
    {
      "name": "Hauru no ugoku shiro",
      "description": "When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle.",
      "genre": [
        "Animation",
        "Adventure",
        "Family"
      ]
    },
    {
      "name": "Three Billboards Outside Ebbing, Missouri",
      "description": null,
      "genre": [
        "Comedy",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Bridge on the River Kwai",
      "description": "British POWs are forced to build a railway bridge across the river Kwai for their Japanese captors in occupied Burma, not knowing that the allied forces are planning a daring commando raid through the jungle to destroy it.",
      "genre": [
        "Adventure",
        "Drama",
        "War"
      ]
    },
    {
      "name": "Trainspotting",
      "description": "Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Prisoners",
      "description": "When Keller Dover's daughter and her friend go missing, he takes matters into his own hands as the police pursue multiple leads and the pressure mounts.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Gran Torino",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Tonari no Totoro",
      "description": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.",
      "genre": [
        "Animation",
        "Comedy",
        "Family"
      ]
    },
    {
      "name": "Catch Me If You Can",
      "description": "Barely 21 yet, Frank is a skilled forger who has passed as a doctor, lawyer and pilot. FBI agent Carl becomes obsessed with tracking down the con man, who only revels in the pursuit.",
      "genre": [
        "Biography",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Million Dollar Baby",
      "description": null,
      "genre": [
        "Drama",
        "Sport"
      ]
    },
    {
      "name": "Bacheha-Ye aseman",
      "description": null,
      "genre": [
        "Drama",
        "Family",
        "Sport"
      ]
    },
    {
      "name": "Blade Runner 2049",
      "description": "Young Blade Runner K's discovery of a long-buried secret leads him to track down former Blade Runner Rick Deckard, who's been missing for thirty years.",
      "genre": [
        "Action",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "The Gold Rush",
      "description": "A prospector goes to the Klondike during the 1890s gold rush in hopes of making his fortune, and is smitten with a girl he sees in a dance hall.",
      "genre": [
        "Adventure",
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Klaus",
      "description": "A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburg's new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Before Sunrise",
      "description": null,
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Harry Potter and the Deathly Hallows: Part 2",
      "description": "Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
      "genre": [
        "Adventure",
        "Family",
        "Fantasy"
      ]
    },
    {
      "name": "12 Years a Slave",
      "description": null,
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "Ben-Hur",
      "description": "After a Jewish prince is betrayed and sent into slavery by a Roman friend in 1st-century Jerusalem, he regains his freedom and comes back for revenge.",
      "genre": [
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "The Grand Budapest Hotel",
      "description": null,
      "genre": [
        "Adventure",
        "Comedy",
        "Crime"
      ]
    },
    {
      "name": "Gone Girl",
      "description": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
      "genre": [
        "Drama",
        "Mystery",
        "Thriller"
      ]
    },
    {
      "name": "Wild Strawberries",
      "description": null,
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "In the Name of the Father",
      "description": "A man's coerced confession to an I.R.A. bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.",
      "genre": [
        "Biography",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Barry Lyndon",
      "description": null,
      "genre": [
        "Adventure",
        "Drama",
        "War"
      ]
    },
    {
      "name": "The Deer Hunter",
      "description": "An in-depth examination of the ways in which the Vietnam War impacts and disrupts the lives of several friends in a small steel mill town in Pennsylvania.",
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Hacksaw Ridge",
      "description": "World War II American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first man in American history to receive the Medal of Honor without firing a shot.",
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "The Wages of Fear",
      "description": null,
      "genre": [
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Salinui chueok",
      "description": "In a small Korean province in 1986, two detectives struggle with the case of multiple young women being found raped and murdered by an unknown culprit.",
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Sherlock Jr.",
      "description": null,
      "genre": [
        "Action",
        "Comedy",
        "Romance"
      ]
    },
    {
      "name": "Relatos salvajes",
      "description": "Six short stories that explore the extremities of human behavior involving people in distress.",
      "genre": [
        "Comedy",
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Mr. Smith Goes to Washington",
      "description": "A naive youth leader is appointed to fill a vacancy in the U.S. Senate. His idealistic plans promptly collide with corruption at home and subterfuge from his hero in Washington, but he tries to forge ahead despite attacks on his c...",
      "genre": [
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Mad Max: Fury Road",
      "description": null,
      "genre": [
        "Action",
        "Adventure",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Mary and Max.",
      "description": "A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York.",
      "genre": [
        "Animation",
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "Det sjunde inseglet",
      "description": "A knight returning to Sweden after the Crusades seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague.",
      "genre": [
        "Drama",
        "Fantasy"
      ]
    },
    {
      "name": "How to Train Your Dragon",
      "description": "A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself, and learns there may be more to the creatures than he assumed.",
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "Monsters, Inc.",
      "description": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Room",
      "description": null,
      "genre": [
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Jaws",
      "description": "When a killer shark unleashes chaos on a beach community off Cape Cod, it's up to a local sheriff, a marine biologist, and an old seafarer to hunt the beast down.",
      "genre": [
        "Adventure",
        "Thriller"
      ]
    },
    {
      "name": "Dead Poets Society",
      "description": "Maverick teacher John Keating uses poetry to embolden his boarding school students to new heights of self-expression.",
      "genre": [
        "Comedy",
        "Drama"
      ]
    },
    {
      "name": "The Big Lebowski",
      "description": null,
      "genre": [
        "Comedy",
        "Crime"
      ]
    },
    {
      "name": "Tokyo Story",
      "description": "An old couple visit their children and grandchildren in the city, but receive little attention.",
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "The Passion of Joan of Arc",
      "description": null,
      "genre": [
        "Short"
      ]
    },
    {
      "name": "Ford v Ferrari",
      "description": "American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966.",
      "genre": [
        "Action",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "Hotel Rwanda",
      "description": null,
      "genre": [
        "Biography",
        "Drama",
        "History"
      ]
    },
    {
      "name": "Rocky",
      "description": null,
      "genre": [
        "Drama",
        "Sport"
      ]
    },
    {
      "name": "Platoon",
      "description": null,
      "genre": [
        "Drama",
        "War"
      ]
    },
    {
      "name": "Ratatouille",
      "description": "A rat who can cook makes an unusual alliance with a young kitchen worker at a famous Paris restaurant.",
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    {
      "name": "Spotlight",
      "description": null,
      "genre": [
        "Biography",
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Terminator",
      "description": "A human soldier is sent from 2029 to 1984 to stop an almost indestructible cyborg killing machine, sent from the same year, which has been programmed to execute a young woman whose unborn son is the key to humanity's future salvat...",
      "genre": [
        "Action",
        "SCIENCE_FICTION"
      ]
    },
    {
      "name": "Stand by Me",
      "description": "After the death of one of his friends, a writer recounts a childhood journey with his friends to find the body of a missing boy.",
      "genre": [
        "Adventure",
        "Drama"
      ]
    },
    {
      "name": "Rush",
      "description": "The merciless 1970s rivalry between Formula One rivals James Hunt and Niki Lauda.",
      "genre": [
        "Action",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "Before Sunset",
      "description": null,
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    {
      "name": "Into the Wild",
      "description": null,
      "genre": [
        "Adventure",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "The Wizard of Oz",
      "description": "Young Dorothy Gale and her dog Toto are swept away by a tornado from their Kansas farm to the magical Land of Oz, and embark on a quest with three new friends to see the Wizard, who can return her to her home and fulfill the other...",
      "genre": [
        "Adventure",
        "Family",
        "Fantasy"
      ]
    },
    {
      "name": "Pather Panchali",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "The Best Years of Our Lives",
      "description": null,
      "genre": [
        "Drama",
        "Romance",
        "War"
      ]
    },
    {
      "name": "Groundhog Day",
      "description": "A narcissistic, self-centered weatherman finds himself in a time loop on Groundhog Day, and the day keeps repeating until he gets it right.",
      "genre": [
        "Comedy",
        "Drama",
        "Fantasy"
      ]
    },
    {
      "name": "The Exorcist",
      "description": "Sequel to the 1973 film about a 12-year-old girl who is possessed by a mysterious demonic entity, forcing her mother to seek the help of two priests to save her.",
      "genre": [
        "Horror"
      ]
    },
    {
      "name": "To Be or Not to Be",
      "description": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
      "genre": [
        "Comedy",
        "Romance",
        "War"
      ]
    },
    {
      "name": "The Incredibles",
      "description": "While trying to lead a quiet suburban life, a family of undercover superheroes are forced into action to save the world.",
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "La haine",
      "description": "24 hours in the lives of three young men in the French suburbs the day after a violent riot.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "description": null,
      "genre": [
        "Action",
        "Adventure",
        "Fantasy"
      ]
    },
    {
      "name": "The Battle of Algiers, a Film Within History",
      "description": "The Battle of Algiers is one of the most celebrated films of all time. Made in 1966, it documented Algeria's war for independence. Returning to the roots of the production and the personalities involved, this documentary explores ...",
      "genre": [
        "Documentary"
      ]
    },
    {
      "name": "Hachi: A Dog's Tale",
      "description": "A college professor bonds with an abandoned dog he takes into his home.",
      "genre": [
        "Biography",
        "Drama",
        "Family"
      ]
    },
    {
      "name": "Jai Bhim",
      "description": null,
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Babam ve Oglum",
      "description": "The family of a left-wing journalist is torn apart after the military coup of Turkey in 1980.",
      "genre": [
        "Drama",
        "Family"
      ]
    },
    {
      "name": "Amores perros",
      "description": null,
      "genre": [
        "Drama",
        "Thriller"
      ]
    },
    {
      "name": "Rebecca",
      "description": null,
      "genre": [
        "Drama",
        "Mystery",
        "Romance"
      ]
    },
    {
      "name": "Cool Hand Luke",
      "description": "A laid back Southern man is sentenced to two years in a rural prison, but refuses to conform.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "Ah-ga-ssi",
      "description": null,
      "genre": [
        "Drama",
        "Romance",
        "Thriller"
      ]
    },
    {
      "name": "Les quatre cents coups",
      "description": "A young boy, left without attention, delves into a life of petty crime.",
      "genre": [
        "Crime",
        "Drama"
      ]
    },
    {
      "name": "The Sound of Music",
      "description": "A young novice is sent by her convent in 1930s Austria to become a governess to the seven children of a widowed naval officer.",
      "genre": [
        "Biography",
        "Drama",
        "Family"
      ]
    },
    {
      "name": "It Happened One Night",
      "description": "A renegade reporter trailing a young runaway heiress for a big story joins her on a bus heading from Florida to New York, and they end up stuck with each other when the bus leaves them behind at one of the stops.",
      "genre": [
        "Comedy",
        "Romance"
      ]
    },
    {
      "name": "Sahsiyet",
      "description": null,
      "genre": [
        "Crime",
        "Drama",
        "Mystery"
      ]
    },
    {
      "name": "Life of Brian",
      "description": null,
      "genre": [
        "Comedy"
      ]
    },
    {
      "name": "The Iron Giant",
      "description": null,
      "genre": [
        "Animation",
        "Action",
        "Adventure"
      ]
    },
    {
      "name": "Dersu Uzala",
      "description": "The Russian army sends an explorer on an expedition to the snowy Siberian wilderness where he makes friends with a seasoned local hunter.",
      "genre": [
        "Adventure",
        "Biography",
        "Drama"
      ]
    },
    {
      "name": "The Help",
      "description": null,
      "genre": [
        "Drama"
      ]
    },
    {
      "name": "Aladdin",
      "description": "A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true.",
      "genre": [
        "Adventure",
        "Comedy",
        "Family"
      ]
    },
    {
      "name": "Dances with Wolves",
      "description": null,
      "genre": [
        "Adventure",
        "Drama",
        "Western"
      ]
    }
  ]
}